{
  "titulo": "Cristo Alvarado's Web Page",
  "resumen_cristo": "Mathematician with a <br> passion for coding.",
  "acerca_de": "About Me",
  "cosas_hago": "My Studies and Work",
  "logros": "Achievements",
  "contacto": "Contact",
  "acerca_de_info": "Pure/applied mathematician who occasionally programs",
  "acerca_de_infpo_detallada": "My main research interests in mathematics include:<ul class='interests'><li>Commutative Algebra</li><li>Algebraic Topology</li><li>Differential Topology</li><li>General Topology</li><li>Logic and Set Theory</li></ul><p style='margin-top: -30px;'>In programming, I am proficient in C, C++, Java, and Python. I am particularly interested in projects addressing mathematical problems, with a strong focus on Machine Learning, Artificial Intelligence, and Data Analysis.</p><p style='margin-top: -30px;'>I am currently working as a SAP Payroll Trainee Consultant at <a href='https://www.linkedin.com/company/dxgrow-people-experience/posts/?feedView=all' target='_blank'>Dxgrow</a>, consistently striving to provide excellent client service, deliver high-quality work, and actively contribute to team collaboration.</p>",
  "estudios": "I pursued a Bachelor’s degree in Physics and Mathematics, specializing in the latter, and graduated with Honors from the <a href='https://www.esfm.ipn.mx/' target='_blank'>Escuela Superior de Física y Matemáticas</a> at the <a href='https://www.ipn.mx/' target='_blank'>Instituto Politécnico Nacional</a> in Mexico.<br>I completed high school education at the <a href='https://www.cecyt9.ipn.mx/' target='_blank'>Centro de Estudios Científicos y Tecnológicos 9 'Juan de Dios Bátiz'</a> of the <a href='https://www.ipn.mx/' target='_blank'>Instituto Politécnico Nacional</a> in Mexico, where I also earned a Technician's degree in Programming.",
  "texto_tesis": "<h4>Bachelor’s Thesis: Consistent Examples in Malykhin’s Problem</h4><p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'>In General Topology, a fundamental problem is determining when a space can be metrizable. For topological groups, the Birkhoff–Kakutani Theorem establishes that they are metrizable if and only if they are “first-countable.”<br><br>This raises the question: can first-countability be weakened? This is done with Fréchet–Urysohn spaces. V. I. Malykhin (1978) asked whether there exists a topological group that is Fréchet–Urysohn and separable, yet still non-metrizable.<br><br>In this thesis, a separable non-metrizable Fréchet–Urysohn topological group is constructed in two consistent models of ZFC.</p>",
  "texto_nombre_repositorio": "Academic Notes Collection",
  "texto_repositorio_1": "Throughout my years as a student, I've had the good fortune to store the notes from the courses I've taken during this period. This repository:",
  "texto_repositorio_2": "Contains notes from every course I have taken or taught, along with additional notes on other topics I've dedicated myself to researching independently. These notes, as well as the LaTeX source code, are free for anyone to take and modify as they wish. Should you find any errors, please contact me so I can resolve the issue as quickly as possible.",
  "texto_dxgrow": "<h4>Jr. SAP Payroll Consultant</h4> <p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'> I currently work at <a href='https://dxgrow.com/'' target='_blank'>Dxgrow</a> as a Jr. SAP Payroll Consultant, participating in SAP system implementation and support projects for payroll management. I have applied my data analysis knowledge to validate information, detect inconsistencies, and generate reports that support decision-making. <br><br> I have also worked with data structures and logical processes in SAP HCM, strengthening my programming and problem-solving skills. This experience has allowed me to link my technical and mathematical knowledge with real business applications, boosting my development in the areas of data analytics and automation.</p>",
  "texto_portfolio": "<h4>Project Portfolio</h4> <p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'> The following is a portfolio of programming, algorithms, and machine learning projects. Some of these projects I have developed during my academic career and others are still in progress. <br><br> I am currently expanding this portfolio with innovative ideas and concrete applications of everything I have learned about mathematics.</p>",
  "caption_pdf": "Click on the image to open document",
  "caption_repository": "Click on the image to open repository",
  "caption_site": "Click on the image to open site",
  "message_me": "Contact Me",
  "message_me_text": "If you are interested in more information (for example, for my CV), you can <strong>send me an email by filling out the fields below</strong>. Thank you!",
  "name_input": "<input type='text' name='name' id='name' placeholder='Name'/>",
  "subject_input": "<input type='text' name='subject' id='subject' placeholder='Subject'/>",
  "message_input": "<textarea name='message' id='message' placeholder='Message' rows='6'></textarea>"
}