{
  "titulo": "Página Cristo Alvarado",
  "resumen_cristo": "Matemático apasionado por la <br> Programación",
  "acerca_de": "Acerca de mí",
  "cosas_hago": "Mis Estudios y Trabajos",
  "logros": "Reconocimientos",
  "contacto": "Contacto",
  "acerca_de_info": "Matemático puro/aplicado que a veces programa",
  "acerca_de_infpo_detallada": "Mis principales áreas de interés en investigación matemática incluyen:<ul><li>Álgebra Conmutativa</li><li>Topología Algebraica</li><li>Topología Diferencial</li><li>Topología General</li><li>Lógica y Teoría de Conjuntos</li></ul><p style='margin-top: -30px;'>En el ámbito de la programación, manejo con soltura los lenguajes C, C++, Java y Python. Me interesan especialmente los proyectos orientados a la resolución de problemas matemáticos, con un enfoque particular en Machine Learning, Inteligencia Artificial y Análisis de Datos.</p><p style='margin-top: -30px;'>Actualmente desempeño el cargo de Consultor Trainee en SAP Payroll en <a href='https://www.linkedin.com/company/dxgrow-people-experience/posts/?feedView=all' target='_blank'>Dxgrow</a>, comprometiéndome siempre a ofrecer un servicio de calidad al cliente, aportar al trabajo en equipo y contribuir de manera efectiva a los proyectos en los que participo.</p>",
  "estudios": "Estudié la Licenciatura en Física y Matemáticas, especializándome en esta última y graduándome con Mención Honorífica en la <a href='https://www.esfm.ipn.mx/' target='_blank'>Escuela Superior de Física y Matemáticas</a> del <a href='https://www.ipn.mx/' target='_blank'>Instituto Politécnico Nacional</a> en México.<br>Hice mis estudios de Bachillerato en el <a href='https://www.cecyt9.ipn.mx/' target='_blank'>Centro de Estudios Científicos y Tecnológicos 9 'Juan de Dios Bátiz'</a> del <a href='https://www.ipn.mx/' target='_blank'>Instituto Politécnico Nacional</a>, también en México, obteniendo además el título de Técnico en Programación.",
  "texto_tesis": "<h4>Tesis de Licenciatura: Ejemplos Consistentes en el Problema de Malykhin</h4><p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'>En Topología General, un problema fundamental es determinar cuándo un espacio puede ser metrizable. Para grupos topológicos el Teorema de Birkhoff-Kakutani establece que son metrizables si y solo si son 'primero numerables'.<br><br>Surge entonces la pregunta: ¿podemos debilitar la primero numerabilidad? Esto se hace con espacios Fréchet-Urysohn. V. I. Malykhin (1978) se preguntó sobre la existencia de un grupo topológico que fuera Fréchet-Urysohn y separable pero que aún así no fuera metrizable.<br><br>En esta tesis se construye un grupo topológico Fréchet-Urysohn y separable no metrizable en dos modelos consistentes de ZFC.</p>",
  "texto_nombre_repositorio": "Colección de Notas Académicas",
  "texto_repositorio_1": "A lo largo de mis años de estudiante tuve la fortuna de poder almacenar las notas de los cursos que he tomado en este período de tiempo. El repositorio:",
  "texto_repositorio_2": "Contiene notas de todos los cursos que he tomado o impartido, junto con algunas adicionales de otros temas que me he dedicado a investigar por mi cuenta. Estas notas son libres, así como el código LaTeX para que cualquiera pueda tomar y modificarlas a su gusto. Errores que se lleguen a encontrar en las mismas, favor de contactarme para poder solucionar el detalle lo antes posible.",
  "texto_dxgrow": "<h4>Consultor Jr. SAP Payroll</h4> <p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'> Trabajo actualmente en <a href='https://dxgrow.com/'' target='_blank'>Dxgrow</a> como Consultor Jr. de SAP Payroll, participando en proyectos de implementación y soporte del sistema SAP para la gestión de nómina. He aplicado mis conocimientos en análisis de datos para validar información, detectar inconsistencias y generar reportes que apoyan la toma de decisiones. <br><br> También he trabajado con estructuras de datos y procesos lógicos en SAP HCM, fortaleciendo mis habilidades en programación y resolución de problemas. Esta experiencia me ha permitido vincular mis conocimientos técnicos y matemáticos con aplicaciones empresariales reales, impulsando mi desarrollo en áreas de analítica de datos y automatización.</p>",
  "texto_portfolio": "<h4>Portafolio de Proyectos</h4> <p style='text-align: justify; font-size: 0.9em; line-height: 1.4;'> El siguiente es un portafolio de proyectos de programación, algoritmos y machine learning. Algunos de estos proyectos los he desarrollado en el transcurso de mi trayectoria académica y otros siguen en progreso. <br><br> Actualmente me encuentro expandiendo este portafolio con ideas inovadoras y aplicaciones concretas de todo lo que he aprendido sobre matemáticas.</p>",
  "caption_pdf": "Click en la imagen para abrir el documento",
  "caption_repository": "Click en la imagen para ir al repositorio",
  "caption_site": "Click en la imagen para ir al sitio",
  "message_me": "Contáctame",
  "message_me_text": "Si te interesa más información al respecto (por ejemplo, para mi CV), puedes <strong>enviarme un correo electrónico llenando los campos a continuación</strong>. ¡Gracias!",
  "name_input": "<input type='text' name='name' id='name' placeholder='Nombre'/>",
  "subject_input": "<input type='text' name='subject' id='subject' placeholder='Asunto'/>",
  "message_input": "<textarea name='message' id='message' placeholder='Mensaje' rows='6'></textarea>"
}